// import Dexie from 'dexie';

// // Create your instance
// var db = new Dexie("MyDatabase");

// // Define your schema
// db.version(1).stores({
//     player: "id,name,message",
//     narrator: "id,name,message",
//     npc0: "id,name,message",
//     npc1: "id,name,message",
// });



// db.narrator.put({
//     id: 'narrator',
//     name: "",
//     message: [
//         "ผมชื่อ",
//         "",
//         "รับงานจากบริษัทฮายเวย์ รหัสจอนวิก",
//         "ผมมีคู่หูอยู่คนหนึ่ง ชื่อ",
//         "",
//         "และมีเพื่อน เป็นตำรวจอีกหนึ่งนาย  ชื่อ",
//         "",
//         "กริ๊งๆๆๆ !!!",
//         "เสียงโทรศัพท์ดังขึ้น",
//         "เเละเเล้วเมื่อเวลา 04:01 นาฬิกา",
//         "เมื่อ มาถึงสถานที่เกินเหตุ",
//         "ก็รีบไปรายงานตัวกับเจ้าหน้าที่ "
//     ]
// });
// db.player.put({
//     id: 'player',
//     name: "",
//     message: [
//         "",
//         "",
//         "กระผม",
//         "ได้รับเเจ้งเหตุจาก",
//         "ว่า เมื่อเวลา 03:32 นาฬิกา",
//         "มีเหตุฆาตกรรมคนตายหนึ่งศพ",
//         "ที่ห้อง 53",
//         "เหตุเกิดในอพาร์ตเม้นอยู่สบาย ",
//         "อำเภอธัญญะ  จังหวัดปทุมธานี",
//         "จึงได้เข้าตรวจสอบ"
//     ]
// });

// db.npc0.put({
//     id: 'npc0',
//     name: "",
//     message: [
//         "ใครโทรมา ว้ะ"
//     ]
// });

// db.npc1.put({
//     id: 'npc1',
//     name: "",
//     message: [
//         "ฮัลโหล เมื่อเวลา 03:32 นาฬิกา",
//         "มีเหตุฆาตกรรม คนตายหนึ่งศพ ที่ห้อง 53",
//         "เหตุเกิดในอพาร์ตเม้นอยู่สบาย ",
//         "อำเภอธัญญะ  จังหวัดปทุมธานี ",
//         " รีบมาด่วน"
//     ]
// });
// db.open();
// export default db


